package ir.avarsaji.faalhafez.util

import kotlin.random.Random

class Statics {
    companion object {
        private val faals: ArrayList<String> = arrayListOf(
            "صلاحِ کار کجا و منِ خراب کجا\n" +
                    "\n" +
                    "ببین تفاوتِ ره کز کجاست تا بکجا\n" +
                    "\n" +
                    "دلم ز صومعه بگرفت و خِرقِهٔ سالوس\n" +
                    "\n" +
                    "کجاست دیرِ مُغان و شرابِ ناب کجا\n" +
                    "\n" +
                    "چه نسبت است به رندی صَلاح و تقوا را\n" +
                    "\n" +
                    "سماعِ وعظ کجا، نغمهٔ رباب کجا\n" +
                    "\n" +
                    "ز رویِ دوست دلِ دشمنان چه دریابد\n" +
                    "\n" +
                    "چراغِ مرده کجا، شمعِ آفتاب کجا\n" +
                    "\n" +
                    "چو کُحلِ بینشِ ما خاکِ آستانِ شماست\n" +
                    "\n" +
                    "کجا رویم؟، بفرما، ازین جناب کجا\n" +
                    "\n" +
                    "مبین به سیبِ زَنَخدان که چاه در راه است\n" +
                    "\n" +
                    "کجا همی\u200C روی ای دل بدین شتاب کجا\n" +
                    "\n" +
                    "بشد، که یاد خوشش باد، روزگارِ وصال\n" +
                    "\n" +
                    "خود آن کرشمه کجا رفت و آن عِتاب کجا\n" +
                    "\n" +
                    "قرار و خواب ز حافظ طمع مدار ای دوست\n" +
                    "\n" +
                    "قرار چیست؟ صبوری کدام و خواب کجا؟",
            "صبا به لطف بگو آن غزال رعنا را\n" +
                    "که سر به کوه و بیابان تو داده\u200Cای ما را\n" +
                    "شکرفروش که عمرش دراز باد چرا\n" +
                    "تَفَقُّدی نکند طوطی شکرخا را\n" +
                    "غرور حُسنت اجازت مگر نداد ای گل؟\n" +
                    "که پرسشی نکنی عَندَلیب شیدا را\n" +
                    "به خُلق و لطف توان کرد صید اهل نظر\n" +
                    "به بند و دام نگیرند مرغ دانا را\n" +
                    "ندانم از چه سبب رنگ آشنایی نیست\n" +
                    "سَهی\u200C قدانِ سیَه\u200C چشمِ ماه\u200C سیما را\n" +
                    "چو با حبیب نشینی و باده پیمایی\n" +
                    "به یاد دار مُحِبّان بادپیما را\n" +
                    "جز این قَدَر نتوان گفت در جمال تو عیب\n" +
                    "که وضع مِهر و وفا نیست روی زیبا را\n" +
                    "در آسمان نه عجب گر به گفتهٔ حافظ\n" +
                    "سرود زُهره به رقص آورد مسیحا را",
            "دل می\u200Cرود ز دستم صاحب\u200Cدلان خدا را\n" +
                    "دردا که راز پنهان خواهد شد آشکارا\n" +
                    "کشتی\u200Cشکستگانیم ای باد شُرطِه برخیز\n" +
                    "باشد که باز بینم دیدار آشنا را\n" +
                    "ده\u200Cروزه مِهر گردون، افسانه است و افسون\n" +
                    "نیکی به جای یاران فرصت شمار یارا\n" +
                    "در حلقهٔ گل\u200C و مُل خوش خواند دوش بلبل\n" +
                    "هاتِ الصَّبُوحَ هُبّوا یا ایُّها السُکارا\n" +
                    "ای صاحب کرامت شکرانهٔ سلامت\n" +
                    "روزی تَفَقُّدی کن درویش بی\u200Cنوا را\n" +
                    "آسایش دو گیتی تفسیر این دو حرف است\n" +
                    "با دوستان مروت با دشمنان مدارا\n" +
                    "در کوی نیک\u200Cنامی ما را گذر ندادند\n" +
                    "گر تو نمی\u200Cپسندی تغییر کن قضا را\n" +
                    "آن تلخ\u200Cوَش که صوفی ام\u200Cُّالخَبائِثَش خواند\n" +
                    "اَشهی لَنا و اَحلی مِن قُبلَةِ العَذارا\n" +
                    "هنگام تنگ\u200Cدستی در عیش کوش و مستی\n" +
                    "کاین کیمیای هستی قارون کُنَد گدا را\n" +
                    "سرکش مشو که چون شمع از غیرتت بسوزد\n" +
                    "دلبر که در کف او موم است سنگ خارا\n" +
                    "آیینهٔ سکندر، جام می است بنگر\n" +
                    "تا بر تو عرضه دارد احوال مُلک دارا\n" +
                    "خوبان پارسی\u200Cگو، بخشندگان عمرند\n" +
                    "ساقی بده بشارت رندان پارسا را\n" +
                    "حافظ به خود نپوشید این خرقهٔ مِی\u200Cْآلود\n" +
                    "ای شیخ پاک\u200Cدامن معذور دار ما را",
            "به ملازمان سلطان که رساند این دعا را؟\n" +
                    "که به شُکرِ پادشاهی ز نظر مران گدا را\n" +
                    "ز رقیب دیوسیرت به خدای خود پناهم\n" +
                    "مگر آن شهاب ثاقب مددی دهد خدا را\n" +
                    "مژهٔ سیاهت ار کرد به خون ما اشارت\n" +
                    "ز فریب او بیندیش و غلط مکن نگارا\n" +
                    "دل عالمی بسوزی چو عِذار برفُروزی\n" +
                    "تو از این چه سود داری که نمی\u200Cکنی مدارا\n" +
                    "همه شب در این امیدم که نسیم صبحگاهی\n" +
                    "به پیام آشنایان بنوازد آشنا را\n" +
                    "چه قیامت است جانا که به عاشقان نمودی؟\n" +
                    "دل و جان فدای رویت بنما عِذار ما را\n" +
                    "به خدا که جرعه\u200Cای ده تو به حافظ سحرخیز\n" +
                    "که دعای صبحگاهی اثری کند شما را",
            "ساقی به نور باده برافروز جامِ ما\n" +
                    "مطرب بگو که کارِ جهان شد به کامِ ما\n" +
                    "ما در پیاله عکس رخ یار دیده\u200Cایم\n" +
                    "ای بی\u200Cخبر ز لذتِ شربِ مدامِ ما\n" +
                    "هرگز نمیرد آن که دلش زنده شد به عشق\n" +
                    "ثبت است بر جریدهٔ عالم دوام ما\n" +
                    "چندان بود کرشمه و نازِ سَهی قدان\n" +
                    "کآید به جلوه سرو صنوبر خرام ما\n" +
                    "ای باد اگر به گلشن احباب بگذری\n" +
                    "زنهار عرضه ده بَرِ جانان پیام ما\n" +
                    "گو نام ما ز یاد به عمدا چه می\u200Cبری\n" +
                    "خود آید آن که یاد نیاری ز نام ما\n" +
                    "مستی به چشمِ شاهدِ دلبندِ ما خوش است\n" +
                    "زآن رو سپرده\u200Cاند به مستی زمام ما\n" +
                    "ترسم که صرفه\u200Cای نبرد روز بازخواست\n" +
                    "نانِ حلالِ شیخ، ز آب حرام ما\n" +
                    "حافظ ز دیده دانهٔ اشکی همی\u200Cفشان\n" +
                    "باشد که مرغِ وصل کند قصدِ دام ما\n" +
                    "دریای اخضر فلک و کشتی هلال\n" +
                    "هستند غرق نعمت حاجی قوام ما"
        )

        public fun getRandomFaal(): String {
            val randomIndex = Random.nextInt(faals.size);
            return faals[randomIndex]
        }
    }
}